golang/std-lib/logrus.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-26 四 14:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>logrus</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="刘尚亮" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">logrus</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaa2c40b">1. 简介</a></li>
<li><a href="#orgdee5365">2. 优点</a></li>
<li><a href="#orgb21e29b">3. 缺点</a></li>
<li><a href="#orgd98e3ec">4. 示例</a>
<ul>
<li><a href="#orgd3e9109">4.1. 标准 logger</a></li>
<li><a href="#orgfc5c563">4.2. 自定义 logger</a></li>
<li><a href="#orgb633b16">4.3. entry</a></li>
<li><a href="#org4fbc1e6">4.4. hook</a></li>
</ul>
</li>
<li><a href="#org6a59128">5. 注意事项</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgaa2c40b" class="outline-2">
<h2 id="orgaa2c40b"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
logrus 是一个日志记录工具，核心思想是日志的记录应该是结构化的，而只是记录一个字符串。
</p>
</div>
</div>

<div id="outline-container-orgdee5365" class="outline-2">
<h2 id="orgdee5365"><span class="section-number-2">2</span> 优点</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><p>
线程安全
</p>

<p>
通过 sync.Mutex 的方式每次对 Logger 进行加锁，获得锁后写入单条日志，然后释放锁。
</p></li>

<li>支持不同的日志等级。</li>

<li>支持不同的目的端。
通过 hook 实现。</li>
</ul>
</div>
</div>

<div id="outline-container-orgb21e29b" class="outline-2">
<h2 id="orgb21e29b"><span class="section-number-2">3</span> 缺点</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><p>
不支持配置文件
</p>

<p>
可以使用替代的解决方案 logrus_mate，但是该工具只支持 json 形式的文件。
</p></li>

<li><p>
不支持对日志文件进行 rotate
</p>

<p>
logrus 在 README 中明确说明如果需要对日志进行 rotate 操作，应由系统中的 logrotate(8) 命令进行，logrus 本身并不支持该操作。
</p></li>

<li><p>
不支持文件名和行号。<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>

<p>
但是可以利用 runtime.Caller 进一步封装，runtime.Caller 可以得到调用者的 pc, 文件名, 文件行数, runtime.FuncForPC(pc).Name() 可以得到 pc 所在的函数名。
</p>
<div class="org-src-container">
<pre class="src src-go">
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgd98e3ec" class="outline-2">
<h2 id="orgd98e3ec"><span class="section-number-2">4</span> 示例</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgd3e9109" class="outline-3">
<h3 id="orgd3e9109"><span class="section-number-3">4.1</span> 标准 logger</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #a1db00;">func</span> <span style="color: #ffd700;">testLogrus</span>() {
    logrus.<span style="color: #ffd700;">SetOutput</span>(os.Stdout)
    logrus.<span style="color: #ffd700;">SetFormatter</span>(&amp;<span style="color: #00d7af;">logrus.JSONFormatter</span>{})
    <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">logrus.SetFormatter(&amp;logrus.TextFormatter{})</span>
    logrus.<span style="color: #ffd700;">SetLevel</span>(logrus.InfoLevel)
    logrus.<span style="color: #ffd700;">Debug</span>(<span style="color: #ff4ea3;">"debug log"</span>)
    logrus.<span style="color: #ffd700;">Info</span>(<span style="color: #ff4ea3;">"info log"</span>)
    logrus.<span style="color: #ffd700;">Info</span>(<span style="color: #a1db00;">map</span>[<span style="color: #00d7af;">string</span>]<span style="color: #00d7af;">int</span>{<span style="color: #ff4ea3;">"age"</span>: 12})
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfc5c563" class="outline-3">
<h3 id="orgfc5c563"><span class="section-number-3">4.2</span> 自定义 logger</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #a1db00;">func</span> <span style="color: #ffd700;">testLogger</span>() {
    <span style="color: #ff8700;">logger</span> := &amp;<span style="color: #00d7af;">logrus.Logger</span>{
        <span style="color: #5fafd7;">Out</span>:       os.Stdout,
        <span style="color: #5fafd7;">Formatter</span>: <span style="color: #d18aff;">new</span>(<span style="color: #00d7af;">logrus.JSONFormatter</span>),
        <span style="color: #5fafd7;">Level</span>:     logrus.DebugLevel,
    }
    logger.<span style="color: #ffd700;">Debug</span>(<span style="color: #ff4ea3;">"debug log"</span>)
    logger.<span style="color: #ffd700;">Info</span>(<span style="color: #ff4ea3;">"info log"</span>)
    logger.<span style="color: #ffd700;">Info</span>(<span style="color: #a1db00;">map</span>[<span style="color: #00d7af;">string</span>]<span style="color: #00d7af;">int</span>{<span style="color: #ff4ea3;">"age"</span>: 12})

}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb633b16" class="outline-3">
<h3 id="orgb633b16"><span class="section-number-3">4.3</span> entry</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #a1db00;">func</span> <span style="color: #ffd700;">testEntry</span>() {
    <span style="color: #ff8700;">logger</span> := &amp;<span style="color: #00d7af;">logrus.Logger</span>{
        <span style="color: #5fafd7;">Out</span>:       os.Stdout,
        <span style="color: #5fafd7;">Formatter</span>: <span style="color: #d18aff;">new</span>(<span style="color: #00d7af;">logrus.JSONFormatter</span>),
        <span style="color: #5fafd7;">Level</span>:     logrus.DebugLevel,
    }

    <span style="color: #ff8700;">e</span> := logrus.<span style="color: #ffd700;">NewEntry</span>(logger)
    e.<span style="color: #ffd700;">WithFields</span>(<span style="color: #00d7af;">logrus.Fields</span>{
        <span style="color: #ff4ea3;">"name"</span>: <span style="color: #ff4ea3;">"lsl"</span>,
        <span style="color: #ff4ea3;">"age"</span>:  30,
    })

    e.<span style="color: #ffd700;">Debug</span>(<span style="color: #ff4ea3;">"debug log"</span>)
    e.<span style="color: #ffd700;">Info</span>(<span style="color: #ff4ea3;">"info log"</span>)
    e.<span style="color: #ffd700;">Warn</span>(e.Level)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4fbc1e6" class="outline-3">
<h3 id="org4fbc1e6"><span class="section-number-3">4.4</span> hook</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<pre class="src src-go"><span style="color: #a1db00;">func</span> <span style="color: #ffd700;">testHook</span>() {
    <span style="color: #ff8700;">logger</span> := logrus.<span style="color: #ffd700;">New</span>()
    <span style="color: #ff8700;">hook</span>, <span style="color: #ff8700;">err</span> := logrus_mail.<span style="color: #ffd700;">NewMailAuthHook</span>(<span style="color: #ff4ea3;">"APPLICATION_NAME"</span>, <span style="color: #ff4ea3;">"HOST"</span>, PORT, <span style="color: #ff4ea3;">"FROM"</span>, <span style="color: #ff4ea3;">"TO"</span>, <span style="color: #ff4ea3;">"USERNAME"</span>, <span style="color: #ff4ea3;">"PASSWORD"</span>)

    <span style="color: #a1db00;">if</span> err != <span style="color: #5fafd7;">nil</span> {
        logger.<span style="color: #ffd700;">Error</span>(<span style="color: #ff4ea3;">"init hook error"</span>)
    }
    logger.Hooks.<span style="color: #ffd700;">Add</span>(hook)

    <span style="color: #ff8700;">e</span> := logger.<span style="color: #ffd700;">WithFields</span>(<span style="color: #00d7af;">logrus.Fields</span>{
        <span style="color: #ff4ea3;">"content"</span>: <span style="color: #ff4ea3;">"test logrus hook"</span>,
    })
    <span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">&#35774;&#32622;&#26102;&#38388;&#25139;&#21644; message</span>
    e.<span style="color: #ffd700;">Error</span>(<span style="color: #ff4ea3;">"&#36825;&#26159;&#19968;&#20010; hook &#21457;&#26469;&#30340;&#37038;&#20214;"</span>)

    <span style="color: #6c6c6c; font-style: italic;">//</span><span style="color: #6c6c6c; font-style: italic;">&#20351;&#29992; Fire &#21457;&#36865;,&#21253;&#21547;&#26102;&#38388;&#25139;&#65292;message</span>
    hook.<span style="color: #ffd700;">Fire</span>(e)

}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6a59128" class="outline-2">
<h2 id="org6a59128"><span class="section-number-2">5</span> 注意事项</h2>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://github.com/sirupsen/logrus/issues/63">Log filename and line number</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: 刘尚亮</p>
<p class="email">Email: <a href="mailto:phenix3443@gmail.com">phenix3443@gmail.com</a></p>
<p class="date">Created: 2020-03-26 四 14:35</p>
<p class="validation"></p>
</div>
</body>
</html>
